{
  "HomePage": {
    "greetingTitle": "Здравствуйте!",
    "intro": "Меня зовут Артем Мороз, я фронтенд-инженер с более чем 10-летним опытом веб-разработки, последние четыре года специализируюсь на React-приложениях.",
    "explore": "Здесь вы можете ознакомиться с некоторыми моими пет-проектами, просмотреть мои сертификаты, узнать о моих навыках и опыте, а также ближе познакомиться со мной, чтобы понять, заинтересованы ли вы в сотрудничестве со мной.",
    "social": "Также вы можете связаться со мной через GitHub и LinkedIn."
  },
  "LanguageSwitcher": {
    "english": "English",
    "russian": "Русский",
    "ukrainian": "Українська"
  },
  "Menu": {
    "home": "Главная",
    "about": "О нас",
    "contact": "Контакты",
    "projects": "Проекты",
    "expertise": "Компетентность"
  },
  "ExpertiseText": {
    "intro": "В данном разделе вы можете ознакомиться с технологиями и инструментами, которые я применяю в своей работе.",
    "experience": "Я занимаюсь веб-разработкой уже более 10 лет. В течение этого времени я разрабатывал и поддерживал интернет-магазины, включая создание и поддержку в сфере электронной коммерции, что позволило мне отлично овладеть бизнес-логикой веб-разработки.",
    "focus": "Последние годы я сосредоточен на фронтенд-разработке, в частности, на библиотеке React и фреймворке Next.js. Мой основной стек включает также Redux, Redux Toolkit, Saga и Thunks для управления состоянием, хотя я также использую Mobx в своих проектах.",
    "approach": "В разработке я уделяю особое внимание архитектуре приложения, его масштабируемости и поддержке. Я придерживаюсь принципов разделения бизнес-логики и UI, что обеспечивает гибкость и удобство в обслуживании кода. Также я применяю мультиязычность и использую популярные пакеты и библиотеки, такие как lodash и classnames, для улучшения функциональности приложений.",
    "ongoingLearning": "Технологии и библиотеки постоянно развиваются, поэтому я уделяю свободное время повышению своей квалификации и расширению знаний. Вы можете ознакомиться с моими сертификатами",
    "here": "тут"
  }
}
