{
  "HomePage": {
    "greetingTitle": "Привіт!",
    "intro": "Мене звати Артем Мороз, я фронтенд-інженер з понад 10-річним досвідом веб-розробки, останні чотири роки спеціалізуюся на React-додатках.",
    "explore": "Тут ви можете ознайомитися з деякими моїми пет-проектами, переглянути мої сертифікати, дізнатися про мої навички та досвід, а також ближче ознайомитися зі мною, щоб зрозуміти, чи вас цікавить співпраця зі мною.",
    "social": "Також ви можете зв’язатися зі мною через GitHub і LinkedIn."
  },
  "LanguageSwitcher": {
    "english": "English",
    "russian": "Русский",
    "ukrainian": "Українська"
  },
  "Menu": {
    "home": "Головна",
    "about": "Про нас",
    "contact": "Контакти",
    "projects": "Проекти",
    "expertise": "Знання"
  },
  "ExpertiseText": {
    "intro": "У цьому розділі ви можете ознайомитися з технологіями та інструментами, які я використовую у своїй роботі.",
    "experience": "Я займаюся веб-розробкою вже понад 10 років. За цей час я розробляв та підтримував інтернет-магазини, включаючи створення та підтримку в сфері електронної комерції, що дозволило мені відмінно опанувати бізнес-логікою веб-розробки.",
    "focus": "Останні роки я зосереджений на фронтенд-розробці, зокрема на бібліотеці React і фреймворку Next.js. Мій основний стек також включає Redux, Redux Toolkit, Saga та Thunks для управління станом, хоча я також використовую Mobx у своїх проєктах.",
    "approach": "В розробці я приділяю особливу увагу архітектурі застосунку, його масштабованості та підтримці. Я дотримуюсь принципів розділення бізнес-логіки та UI, що забезпечує гнучкість і зручність в обслуговуванні коду. Також я застосовую мультиязичність і використовую популярні пакети та бібліотеки, такі як lodash та classnames, для покращення функціональності застосунків.",
    "ongoingLearning": "Технології та бібліотеки постійно розвиваються, тому я присвячую вільний час підвищенню своєї кваліфікації та розширенню знань. Ви можете ознайомитися з моїми сертифікатами",
    "here": "тут"
  }
}
